app/controllers/users_controller.rb

   def create
     @user = User.create params[:user]
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "email") VALUES('Rohit', '21835856000.310745445663162', '2010-02-28 03:03:17', '2010-02-28 03:03:17', '3c9a0880f493e7a14243778e53793424162500ce', 'rohit.net@gmail.com')

   def update
     @user = current_user
     file_path = "#{RAILS_ROOT}/public/data/#{@user.id}.xml"
     if params[:file].instance_of?(Tempfile)
       FileUtils.copy(params[:file].local_path, file_path)
     else
       File.open(file_path,"w"){|f|
                f.write(params[:file].read)
                f.close}
     end

     library = Library.new
     library.parse(file_path)
     File.delete(file_path)

     @user.library.destroy unless @user.library.nil?
     @user.library = library
     @user.save!
---
DELETE FROM "libraries" WHERE "id" = 2
INSERT INTO "libraries" ("created_at", "persistent_id", "updated_at", "user_id") VALUES('2010-02-28 20:07:14', '467CC210AF83AC71', '2010-02-28 20:07:14', 9)
UPDATE "libraries" SET "updated_at" = '2010-02-28 20:09:01', "user_id" = NULL WHERE "id" = 1
UPDATE "users" SET "updated_at" = '2010-02-28 12:21:03', "file_uploaded_at" = '2010-02-28 12:21:03' WHERE "id" = 1